Revit 2027 API
ParameterTypeId.DesignOptionParam Property
 "Design Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DesignOptionParam { get; }
Public Shared ReadOnly Property DesignOptionParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DesignOptionParam {
	ForgeTypeId^ get ();
}
static member DesignOptionParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace